conf/src/Reports/ЭП_ОценкаРезультативности/ЭП_ОценкаРезультативности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЭП_ОценкаРезультативности</name>
</mdclass:Report>

conf/src/InformationRegisters/ЭП_ЭффективностьСотрудников/ЭП_ЭффективностьСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ЭффективностьСотрудников</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодОценивания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрофильРасчета</name>
    <type>
      <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Reports/ЭП_ОценкаРезультативности/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура РезультатОбработкаРасшифровкиНаСервере(Сотрудник)
	
	ПараметрДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	Если НЕ ПараметрДанных = Неопределено Тогда
		ПараметрПользовательскойНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
		Если ПараметрПользовательскойНастройки <> Неопределено Тогда
			ПараметрНачалоПериода = ПараметрПользовательскойНастройки.Значение.Дата;
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
			
	Иначе
		
		Возврат;	
		
	КонецЕсли;
	
	ПериодОценивания = НачалоМесяца(ПараметрНачалоПериода);
	
	ТаблицаДанных = ПолучитьТаблицуДанных(ПериодОценивания, Сотрудник);
		
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");

	СхемаРасшифровки = ОбъектОтчет.ПолучитьМакет("СхемаРасшифровка");  
	
	НастройкиОСКД = СхемаРасшифровки.НастройкиПоУмолчанию;
		
	ПараметрыДанныхОСКД = НастройкиОСКД.ПараметрыДанных.Элементы;
	
	ЭлементНачалоПериода = ПараметрыДанныхОСКД.Найти("ПериодОценивания");
	
	ЭлементНачалоПериода.Использование = Истина;
	
	ЭлементНачалоПериода.Значение = ПериодОценивания;
	
	ЭлементКонецПериода = ПараметрыДанныхОСКД.Найти("Сотрудник");
	
	ЭлементКонецПериода.Использование = Истина;
	
	ЭлементКонецПериода.Значение = Сотрудник;
	
	КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакетаОСКД.Выполнить(СхемаРасшифровки, НастройкиОСКД);
	
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет);
	
	РезультатРасшифровка.Очистить();
	
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаОСКД.УстановитьДокумент(РезультатРасшифровка);
	
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)	
	
	Если НЕ ТипЗнч(Расшифровка) = Тип("СправочникСсылка.ЭП_Сотрудники") Тогда
		ПолеРасшифровки = ПолучитьРасшифровкуНаСервере(Расшифровка);	
		Если ПолеРасшифровки.ЗаголовокПоля = "Значение" Тогда
			СтандартнаяОбработка = Ложь;
			РезультатОбработкаРасшифровкиНаСервере(ПолеРасшифровки.Ссылка);
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаРасшифровка;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуДанных(ПериодОценивания, ТекСотрудник)
	
    Отбор = Новый Структура("Сотрудник", ТекСотрудник);
	ПромежуточныйРезультат = Отчеты.ЭП_РасчетРезультативности.ПолучитьРасчетРезультативности(ПериодОценивания, Отбор);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭП_ЭффективностьСотрудников.ПрофильРасчета КАК ПрофильРасчета,
	               |	ЭП_ЭффективностьСотрудников.Показатель КАК Показатель,
	               |	ЭП_ЭффективностьСотрудников.Значение КАК Значение,
	               |	ЭП_ЭффективностьСотрудников.Комментарий КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.ЭП_ЭффективностьСотрудников КАК ЭП_ЭффективностьСотрудников
	               |ГДЕ
	               |	ЭП_ЭффективностьСотрудников.Сотрудник = &Сотрудник
	               |	И ЭП_ЭффективностьСотрудников.ПериодОценивания = &ПериодОценивания
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПрофильРасчета";
	Запрос.УстановитьПараметр("Сотрудник", ТекСотрудник);
	Запрос.УстановитьПараметр("ПериодОценивания", ПериодОценивания);
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();	
	Возврат ТаблицаДанных;
	
КонецФункции 

&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка)

	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();

	ИндексТекущегоЭлемента = Число(Расшифровка); 
	
	Пока ИндексТекущегоЭлемента > 0 Цикл
		Поле = Данные.Элементы[ИндексТекущегоЭлемента].ПолучитьПоля();
		Если Поле[0].Поле = "ТабельныйНомер" Тогда
			Ссылка = Поле[0].Значение;
			Прервать;
		КонецЕсли;
		ИндексТекущегоЭлемента = ИндексТекущегоЭлемента-1;
	КонецЦикла;
	
	СсылкаСотрудника = Новый Структура;
	СсылкаСотрудника.Вставить("Ссылка", Ссылка);
	СсылкаСотрудника.Вставить("ЗаголовокПоля", Поля[0].Поле);
	Возврат СсылкаСотрудника;
	
КонецФункции
